<template>
  <section>
    <i>Сервис мониторинга сосудов позволяет вести историю изменений и автоматический сбор количественных данных по эксплуатации через SLIM систему.</i>
    <br>
    <span
      class="link_upd"
      @click="isHidden = !isHidden">Как пользоваться сервисом?</span>
    <transition name="fade">
      <div 
        v-if="isHidden"
        id="descriptionTable"
        class="sampleBox"
      >
        <h4>1 СОЗДАНИЕ СОСУДА</h4>
        <ul>
          Для создания сосуда необходимо:
          <li>
            Нажать кнопку
            <span class="link_upd">«Добавить сосуд»</span>.
          </li>
          <li>
            В поле
            <strong>«Статус»</strong> указать текущий статус сосуда. Данное поле служит только для визуализации общего состяния сосудов по локации.
          </li>
          <li>
            В поле
            <strong>«Серийный номер»</strong> внести S/N сосуда. Обратите внимание,
            <strong>«Серийный номер»</strong> в сервисе и программах
            <strong>приборов</strong> калориметров должны быть
            <strong>идентичны</strong>.
          </li>
          <li>
            В поле
            <strong>«Дата создания»</strong> указать дату, с которой начинается мониторинг за состоянием сосуда.
          </li>
          <li>
            В поле
            <strong>«Испытаниe в ЦСМ»</strong> указать дату, в случае, когда испытание не производилось, можно оставить пустое значение. При этом, сервис будет напоминать о необходимости испытания в таблице сосудов.
          </li>
          <li>
            В поле
            <strong>«Дата проверки»</strong> указать дату осмотра сосуда специалистами SGS.
          </li>
          <li>
            В поле
            <strong>«Локация»</strong> указать локацию, в которой находится сосуд. Обратите внимание, что перемещение между локациями также возможно, без потери истории.
          </li>
          <li>
            В поле
            <strong>«Оценка»</strong> указать оценку от 2 до 5, где 5 - идеальное состояние сосуда, а 2 - сосуд изъят из эксплуатации и должен быть утилизирован.
          </li>
          <li>
            В поле
            <strong>«Состояние»</strong> будет заполнено сервисом
            <strong>самостоятельно</strong>, в соответствии с оценкой.
          </li>
          <li>
            После заполнения полей необходимо нажать кнопку
            <span class="link_upd">«Сохранить»</span>, произойдет
            <strong>создание</strong> сосуда.
          </li>
          <li>
            Если все операции выполнены правильно в таблице
            <strong>«ИСТОРИЯ ПО СОСУДУ»</strong> отобразятся изменения. Также сосуд будет доступен в общей таблице.
          </li>
        </ul>

        <h4>2 ИЗМЕНЕНИЕ ИНФОРМАЦИИ ПО СОСУДУ</h4>
        <ul>
          Для изменения информации необходимо:
          <li>
            Нажать на
            <strong>серийный номер</strong> нужного сосуда в общей таблице.
          </li>
          <li>Внести изменения.</li>
          <li>
            Нажать кнопку
            <span class="link_upd">«Сохранить»</span>, произойдет
            <strong>сохранение</strong> изменений сосуда.
          </li>
          <li>
            Если все операции выполнены правильно в таблице
            <strong>«ИСТОРИЯ ПО СОСУДУ»</strong> отобразятся изменения. Также изменения по сосуду будут доступны в общей таблице.
          </li>
        </ul>
        <p>
          Для
          <strong>утилизации</strong> сосуда необходимо внести
          <strong>оценку 2</strong> и
          <span class="link_upd">сохранить</span> изменения.
        </p>
        <i>
          После утилизации сервис
          <strong>перестанет</strong> искать новые измерения в SLIM и выводить их в историю эксплуатации.
        </i>

        <h4>3 ОБНОВЛЕНИЕ КОЛИЧЕСТВЕННЫХ ДАННЫХ ПО ЭКСПЛУАТАЦИИ</h4>
        <ul>
          Обновление данных возможно 2 вариантами:
          <li>В автоматическом режиме по расписанию - каждый понедельник в 8:30. Дополнительный автоматический запуск каждое первое число месяца в 8:30.</li>
          <li>
            В ручном режиме - кликом по дате в колонке
            <strong>«Последнее обновление»</strong> по интересующему сосуду.
          </li>
        </ul>

        <h4>4 ГРАФИЧЕСКИЕ ВОЗМОЖНОСТИ СЕРВИСА</h4>
        <p>
          При нажатии на
          <strong>серийный номер</strong> нужного сосуда в общей таблице открывается модальное окно с графическом отображением количественных данных по эксплуатации для
          <strong>одного</strong> сосуда.
        </p>
        <p>
          При нажатии на подзаголовок
          <strong>статуса</strong> сосудов в общей таблице открывается модальное окно с графическом отображением количественных данных по эксплуатации для
          <strong>группы</strong> сосудов.
        </p>
        <i>График может быть сохранён как JPEG, PNG, PGF или SVG или распечатан.</i>
      </div>
    </transition>
  </section>
</template>

<script>
export default {
  name: 'HowToUse',
  data() {
    return {
      isHidden: false,
    };
  },
};
</script>

<style scoped>
.fade-enter-active,
.fade-leave-active {
  transition: opacity 0.5s;
}
.fade-enter, .fade-leave-to /* .fade-leave-active below version 2.1.8 */ {
  opacity: 0;
}
</style>

